### Report for environment: prod

#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "5.60.0"...
- Installing hashicorp/aws v5.60.0...
- Installed hashicorp/aws v5.60.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan ()</summary>

```

aws_ssm_parameter.db_host: Refreshing state... [id=/repo/prod/output/prm-repo-ehr-out-service/db-host]
aws_rds_cluster.ehr_out_service: Refreshing state... [id=prod-ehr-out-service-cluster]
aws_security_group.ehr_out_service_db_sg: Refreshing state... [id=sg-0e692308c08c8b7af]
aws_ssm_parameter.db_name: Refreshing state... [id=/repo/prod/output/prm-repo-ehr-out-service/db-name]
aws_ssm_parameter.db_resource_cluster_id: Refreshing state... [id=/repo/prod/output/prm-repo-ehr-out-service/db-resource-cluster-id]
aws_kms_key.ehr_out_service_db_key: Refreshing state... [id=bff26a73-7696-404d-abc1-4b9c189a1bed]
aws_db_subnet_group.ehr_out_service_db: Refreshing state... [id=prod-ehr-out-service-db-subnet-group]
aws_rds_cluster_instance.ehr_out_service_db_instances[0]: Refreshing state... [id=prod-ehr-out-service-db-instance-0]
aws_security_group.vpn_to_db_sg: Refreshing state... [id=sg-00eb5a853d344a9d9]
aws_rds_cluster_instance.ehr_out_service_db_instances[2]: Refreshing state... [id=prod-ehr-out-service-db-instance-2]
aws_ssm_parameter.service_url: Refreshing state... [id=/repo/prod/output/prm-repo-ehr-out-service/ehr-out-service-service-url]
aws_security_group.gocd_to_db_sg: Refreshing state... [id=sg-09ae87c66f1831b1e]
aws_kms_alias.ehr_out_service_db_key: Refreshing state... [id=alias/ehr-out-service-db-key]
data.aws_ssm_parameter.service-to-gp2gp-messenger-sg-id: Reading...
aws_rds_cluster_instance.ehr_out_service_db_instances[1]: Refreshing state... [id=prod-ehr-out-service-db-instance-1]
data.aws_ssm_parameter.deductions_core_vpc_id: Reading...
data.aws_ssm_parameter.dynamodb_name: Reading...
data.aws_ssm_parameter.deductions_private_db_subnets: Reading...
data.aws_ssm_parameter.ehr_in_unhandled_sns_topic_arn: Reading...
data.aws_ssm_parameter.ehr_repo_authorization_keys: Reading...
data.aws_ssm_parameter.environment_public_zone_id: Reading...
data.aws_ssm_parameter.vpn_sg_id: Reading...
data.aws_ssm_parameter.service-to-gp2gp-messenger-sg-id: Read complete after 0s [id=/repo/prod/output/prm-deductions-gp2gp-messenger/service-to-gp2gp-messenger-sg-id]
data.aws_ssm_parameter.repository_asid: Reading...
data.aws_ssm_parameter.deductions_core_vpc_id: Read complete after 0s [id=/repo/prod/output/prm-deductions-infra/deductions-core-vpc-id]
data.aws_sns_topic.alarm_notifications: Reading...
data.aws_ssm_parameter.dynamodb_name: Read complete after 0s [id=/repo/prod/output/prm-deductions-infra/ehr-transfer-tracker-db-name]
data.aws_ssm_parameter.deductions_private_private_subnets: Reading...
data.aws_ssm_parameter.deductions_private_db_subnets: Read complete after 0s [id=/repo/prod/output/prm-deductions-infra/deductions-private-database-subnets]
data.aws_ssm_parameter.environment_private_zone_id: Reading...
data.aws_ssm_parameter.ehr_in_unhandled_sns_topic_arn: Read complete after 0s [id=/repo/prod/output/ehr-transfer-service/ehr-in-unhandled-sns-topic-arn]
data.aws_ssm_parameter.gocd_sg_id: Reading...
data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.service-to-ehr-repo-sg-id: Reading...
data.aws_ssm_parameter.ehr_repo_authorization_keys: Read complete after 0s [id=/repo/prod/user-input/api-keys/ehr-repo/ehr-out-service]
data.aws_ssm_parameter.environment_domain_name: Reading...
data.aws_ssm_parameter.environment_public_zone_id: Read complete after 0s [id=/repo/prod/output/prm-deductions-infra/environment-public-zone-id]
data.aws_ssm_parameter.deductions_private_vpc_id: Reading...
data.aws_ssm_parameter.vpn_sg_id: Read complete after 0s [id=/repo/prod/output/prm-deductions-infra/vpn-sg-id]
data.aws_iam_policy_document.ecs-assume-role-policy: Reading...
data.aws_iam_policy_document.ecs-assume-role-policy: Read complete after 0s [id=1077804475]
data.aws_ssm_parameter.dynamodb_prefix_list_id: Reading...
data.aws_ssm_parameter.repository_asid: Read complete after 0s [id=/repo/prod/user-input/external/repository-asid]
data.aws_ssm_parameter.private_zone_id: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=535760944720]
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:eu-west-2:535760944720:cluster/prod-ehr-out-service]
data.aws_ssm_parameter.deductions_private_private_subnets: Read complete after 0s [id=/repo/prod/output/prm-deductions-infra/deductions-private-private-subnets]
data.aws_ssm_parameter.environment_private_zone_id: Read complete after 0s [id=/repo/prod/output/prm-deductions-infra/environment-private-zone-id]
data.aws_ssm_parameter.gp2gp_messenger_authorization_keys: Reading...
data.aws_vpc.deductions-core: Reading...
data.aws_ssm_parameter.gocd_sg_id: Read complete after 0s [id=/repo/prod/user-input/external/gocd-agent-sg-id]
data.aws_route53_zone.environment_public_zone: Reading...
data.aws_ssm_parameter.service-to-ehr-repo-sg-id: Read complete after 0s [id=/repo/prod/output/prm-deductions-ehr-repository/service-to-ehr-repo-sg-id]
aws_iam_role.component_ecs_role: Refreshing state... [id=prod-ehr-out-service-EcsTaskRole]
data.aws_ssm_parameter.environment_domain_name: Read complete after 0s [id=/repo/prod/output/prm-deductions-infra/environment-domain-name]
data.aws_iam_policy_document.kms_key_policy_doc: Reading...
data.aws_iam_policy_document.kms_key_policy_doc: Read complete after 0s [id=2871702320]
data.aws_iam_policy_document.transfer_tracker_indexes_access: Reading...
data.aws_iam_policy_document.transfer_tracker_indexes_access: Read complete after 0s [id=409361644]
data.aws_iam_policy_document.dynamodb_policy_doc: Reading...
data.aws_iam_policy_document.dynamodb_policy_doc: Read complete after 0s [id=317164360]
aws_cloudwatch_log_group.log_group: Refreshing state... [id=/nhs/deductions/prod-535760944720/ehr-out-service]
data.aws_ssm_parameter.dynamodb_prefix_list_id: Read complete after 0s [id=/repo/prod/output/prm-deductions-infra/dynamodb_prefix_list_id]
data.aws_ssm_parameter.deductions_private_vpc_id: Read complete after 0s [id=/repo/prod/output/prm-deductions-infra/private-vpc-id]
data.aws_iam_policy_document.ssm_policy_doc: Reading...
data.aws_iam_policy_document.ecr_policy_doc: Reading...
data.aws_iam_policy_document.ssm_policy_doc: Read complete after 0s [id=509859321]
data.aws_iam_policy_document.ecr_policy_doc: Read complete after 1s [id=3090274976]
data.aws_iam_policy_document.logs_policy_doc: Reading...
aws_kms_key.service_incoming: Refreshing state... [id=c48be3ca-1ac9-46df-8a10-29ffb77cd9cf]
data.aws_iam_policy_document.logs_policy_doc: Read complete after 0s [id=2050229310]
data.aws_ssm_parameter.private_zone_id: Read complete after 1s [id=/repo/prod/output/prm-deductions-infra/private-root-zone-id]
data.aws_vpc_endpoint.ecr-api: Reading...
aws_security_group.service_from_alb: Refreshing state... [id=sg-03106195bb590264d]
data.aws_sns_topic.alarm_notifications: Read complete after 1s [id=arn:aws:sns:eu-west-2:535760944720:prod-alarm-notifications-sns-topic]
data.aws_vpc.deductions-private: Reading...
data.aws_ssm_parameter.gp2gp_messenger_authorization_keys: Read complete after 1s [id=/repo/prod/user-input/api-keys/gp2gp-messenger/ehr-out-service]
aws_security_group.vpn_to_service_alb: Refreshing state... [id=sg-0f5cdc102a1794d5e]
data.aws_vpc_endpoint.ecr-dkr: Reading...
data.aws_route53_zone.environment_public_zone: Read complete after 1s [id=Z03667822QZ8RSZRQVF9T]
data.aws_vpc_endpoint.ssm: Reading...
aws_security_group.gocd_to_service_alb: Refreshing state... [id=sg-06495eda1ee3414ff]
data.aws_vpc_endpoint.logs: Reading...
data.aws_vpc_endpoint.s3: Reading...
aws_alb_target_group.internal_alb_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:535760944720:targetgroup/prod-ehr-out-service-int-tg/81d79e0963fe5db1]
aws_iam_policy.ecr_policy: Refreshing state... [id=arn:aws:iam::535760944720:policy/prod-ehr-out-service-ecr]
data.aws_vpc_endpoint.ecr-api: Read complete after 0s [id=vpce-08154592a64e7fed2]
aws_iam_policy.ssm_policy: Refreshing state... [id=arn:aws:iam::535760944720:policy/prod-ehr-out-service-ssm]
aws_iam_policy.logs_policy: Refreshing state... [id=arn:aws:iam::535760944720:policy/prod-ehr-out-service-logs]
aws_acm_certificate.service_cert: Refreshing state... [id=arn:aws:acm:eu-west-2:535760944720:certificate/4fe9ca68-7428-47d3-a9d1-e9cf5b35e527]
data.aws_vpc_endpoint.ssm: Read complete after 0s [id=vpce-09c32568ca968e607]
aws_kms_alias.service_incoming_queue_key: Refreshing state... [id=alias/prod-ehr-out-service-incoming-queue-key]
data.aws_iam_policy_document.kms_policy_doc: Reading...
data.aws_iam_policy_document.kms_policy_doc: Read complete after 0s [id=1039582179]
aws_iam_role_policy_attachment.ecr_policy_attach: Refreshing state... [id=prod-ehr-out-service-EcsTaskRole-20230213143317305500000002]
data.aws_vpc_endpoint.ecr-dkr: Read complete after 0s [id=vpce-0797e1fa6a54e137c]
aws_sqs_queue.service_incoming: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/535760944720/prod-ehr-out-service-incoming]
aws_iam_role_policy_attachment.ssm_policy_attach: Refreshing state... [id=prod-ehr-out-service-EcsTaskRole-20230213143317333300000003]
aws_iam_policy.kms_policy: Refreshing state... [id=arn:aws:iam::535760944720:policy/prod-ehr-out-service-kms]
data.aws_vpc_endpoint.logs: Read complete after 0s [id=vpce-09fd461fa59d5e385]
aws_iam_role_policy_attachment.logs_policy_attach: Refreshing state... [id=prod-ehr-out-service-EcsTaskRole-20230213143317389200000004]
data.aws_vpc_endpoint.s3: Read complete after 0s [id=vpce-099b35f03837ba38d]
aws_iam_role_policy_attachment.kms_policy_attach: Refreshing state... [id=prod-ehr-out-service-EcsTaskRole-20230213143330599400000005]
data.aws_vpc.deductions-core: Read complete after 1s
data.aws_vpc.deductions-private: Read complete after 0s
aws_security_group.ecs_tasks_sg: Refreshing state... [id=sg-0da5787a08c9d95cd]
aws_route53_record.service_cert_validation_record["ehr-out-service.prod.patient-deductions.nhs.uk"]: Refreshing state... [id=Z03667822QZ8RSZRQVF9T__ccb6cc233c402c34772eb1c9051c57e1.ehr-out-service.prod.patient-deductions.nhs.uk._CNAME]
aws_sqs_queue_policy.ehr_out_service_incoming: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/535760944720/prod-ehr-out-service-incoming]
aws_ecs_task_definition.task: Refreshing state... [id=ehr-out-service]
aws_iam_policy.sqs_policy: Refreshing state... [id=arn:aws:iam::535760944720:policy/prod-ehr-out-service-sqs]
aws_sns_topic_subscription.ehr_in_unhandled_topic: Refreshing state... [id=arn:aws:sns:eu-west-2:535760944720:prod-ehr-transfer-service-unhandled-sns-topic:88169b8d-f59e-49e0-9fe7-f3671801e219]
aws_security_group_rule.app_to_ehr_repo: Refreshing state... [id=sgrule-2424980499]
aws_cloudwatch_metric_alarm.ehr_out_service_incoming_age_of_message: Refreshing state... [id=prod-ehr-out-service-incoming-queue-approx-age-of-oldest-message]
aws_security_group_rule.app_to_gp2gp_messenger: Refreshing state... [id=sgrule-2934614612]
aws_security_group.alb_to_app_ecs: Refreshing state... [id=sg-0e30ea5c98f510618]
aws_iam_role_policy_attachment.sqs_policy_attach: Refreshing state... [id=prod-ehr-out-service-EcsTaskRole-20230213143355756200000006]
aws_acm_certificate_validation.service_cert_validation: Refreshing state... [id=2023-02-13 14:33:40.173 +0000 UTC]
aws_alb.alb_internal: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:535760944720:loadbalancer/app/prod-ehr-out-service-alb-int/11f53378a6701d1b]
aws_cloudwatch_metric_alarm.alb_http_errors: Refreshing state... [id=prm-repo-ehr-out-service 5xx errors]
aws_route53_record.service: Refreshing state... [id=Z03677701T67Q4XUAJ6TG_ehr-out-service_CNAME]
aws_alb_listener.int_alb_listener_https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:535760944720:listener/app/prod-ehr-out-service-alb-int/11f53378a6701d1b/b8146e54549b27b3]
aws_alb_listener.int_alb_listener_http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:535760944720:listener/app/prod-ehr-out-service-alb-int/11f53378a6701d1b/ea77de810da29d82]
aws_alb_listener_rule.int_alb_http_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:535760944720:listener-rule/app/prod-ehr-out-service-alb-int/11f53378a6701d1b/ea77de810da29d82/b0159d203951fa69]
aws_lb_listener_certificate.app_internal_listener_cert: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:535760944720:listener/app/prod-ehr-out-service-alb-int/11f53378a6701d1b/b8146e54549b27b3_arn:aws:acm:eu-west-2:535760944720:certificate/4fe9ca68-7428-47d3-a9d1-e9cf5b35e527]
aws_alb_listener_rule.int_alb_https_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:535760944720:listener-rule/app/prod-ehr-out-service-alb-int/11f53378a6701d1b/b8146e54549b27b3/4cefb6498bc2168f]
aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:eu-west-2:535760944720:service/prod-ehr-out-service/prod-ehr-out-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ehr_out_service_incoming_policy_doc will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ehr_out_service_incoming_policy_doc" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:eu-west-2:535760944720:prod-ehr-out-service-incoming",
            ]

          + condition {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.sqs_policy_doc will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "sqs_policy_doc" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:DeleteMessage",
              + "sqs:GetQueue*",
              + "sqs:ReceiveMessage",
            ]
          + resources = [
              + "arn:aws:sqs:eu-west-2:535760944720:prod-ehr-out-service-incoming",
            ]
        }
    }

  # aws_db_subnet_group.ehr_out_service_db will be destroyed
  # (because aws_db_subnet_group.ehr_out_service_db is not in configuration)
  - resource "aws_db_subnet_group" "ehr_out_service_db" {
      - arn                     = "arn:aws:rds:eu-west-2:535760944720:subgrp:prod-ehr-out-service-db-subnet-group" -> null
      - description             = "Managed by Terraform" -> null
      - id                      = "prod-ehr-out-service-db-subnet-group" -> null
      - name                    = "prod-ehr-out-service-db-subnet-group" -> null
      - subnet_ids              = (sensitive value) -> null
      - supported_network_types = [
          - "IPV4",
        ] -> null
      - tags                    = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
          - "Name"        = "prod-ehr-out-service-db-subnet-group"
        } -> null
      - tags_all                = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
          - "Name"        = "prod-ehr-out-service-db-subnet-group"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # aws_ecs_service.ecs_service will be updated in-place
  ~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:eu-west-2:535760944720:service/prod-ehr-out-service/prod-ehr-out-service"
        name                               = "prod-ehr-out-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-2:535760944720:task-definition/ehr-out-service:2" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:eu-west-2:535760944720:task-definition/ehr-out-service:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-2:535760944720:task-definition/ehr-out-service" -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ cpu                      = "256" -> "512" # forces replacement
      ~ id                       = "ehr-out-service" -> (known after apply)
      ~ memory                   = "512" -> "1024" # forces replacement
      ~ revision                 = 2 -> (known after apply)
        tags                     = {
            "CreatedBy"   = "prm-repo-ehr-out-service"
            "Environment" = "prod"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_iam_policy.dynamodb_policy will be created
  + resource "aws_iam_policy" "dynamodb_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "prod-ehr-out-service-dynamodb"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:eu-west-2:535760944720:table/prod-ehr-transfer-tracker"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.sqs_policy will be updated in-place
  ~ resource "aws_iam_policy" "sqs_policy" {
        id               = "arn:aws:iam::535760944720:policy/prod-ehr-out-service-sqs"
        name             = "prod-ehr-out-service-sqs"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueue*",
                          - "sqs:DeleteMessage",
                          - "sqs:ChangeMessageVisibility",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:eu-west-2:535760944720:prod-ehr-out-service-incoming"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.ssm_policy will be updated in-place
  ~ resource "aws_iam_policy" "ssm_policy" {
        id               = "arn:aws:iam::535760944720:policy/prod-ehr-out-service-ssm"
        name             = "prod-ehr-out-service-ssm"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (7 unchanged elements hidden)
                            "arn:aws:ssm:eu-west-2:535760944720:parameter/repo/prod/user-input/api-keys/ehr-out-service/*",
                          - "arn:aws:ssm:eu-west-2:535760944720:parameter/repo/prod/output/prm-deductions-gp2gp-messenger/service-url",
                        ]
                      - Sid      = ""
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.transfer_tracker_indexes_access will be created
  + resource "aws_iam_policy" "transfer_tracker_indexes_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "prod-ehr-out-service-transfer-tracker-indexes-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "dynamodb:Query"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:eu-west-2:535760944720:table/prod-ehr-transfer-tracker/index/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role_policy_attachment.dynamodb_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "dynamodb_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "prod-ehr-out-service-EcsTaskRole"
    }

  # aws_iam_role_policy_attachment.ecs_dynamo_indexes will be created
  + resource "aws_iam_role_policy_attachment" "ecs_dynamo_indexes" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "prod-ehr-out-service-EcsTaskRole"
    }

  # aws_kms_alias.ehr_out_service_db_key will be destroyed
  # (because aws_kms_alias.ehr_out_service_db_key is not in configuration)
  - resource "aws_kms_alias" "ehr_out_service_db_key" {
      - arn            = "arn:aws:kms:eu-west-2:535760944720:alias/ehr-out-service-db-key" -> null
      - id             = "alias/ehr-out-service-db-key" -> null
      - name           = "alias/ehr-out-service-db-key" -> null
      - target_key_arn = "arn:aws:kms:eu-west-2:535760944720:key/bff26a73-7696-404d-abc1-4b9c189a1bed" -> null
      - target_key_id  = "bff26a73-7696-404d-abc1-4b9c189a1bed" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_kms_key.ehr_out_service_db_key will be destroyed
  # (because aws_kms_key.ehr_out_service_db_key is not in configuration)
  - resource "aws_kms_key" "ehr_out_service_db_key" {
      - arn                                = "arn:aws:kms:eu-west-2:535760944720:key/bff26a73-7696-404d-abc1-4b9c189a1bed" -> null
      - bypass_policy_lockout_safety_check = false -> null
      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null
      - description                        = "ehr-out-service DB KMS key in prod environment" -> null
      - enable_key_rotation                = false -> null
      - id                                 = "bff26a73-7696-404d-abc1-4b9c189a1bed" -> null
      - is_enabled                         = true -> null
      - key_id                             = "bff26a73-7696-404d-abc1-4b9c189a1bed" -> null
      - key_usage                          = "ENCRYPT_DECRYPT" -> null
      - multi_region                       = false -> null
      - policy                             = jsonencode(
            {
              - Id        = "key-default-1"
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::535760944720:root"
                        }
                      - Resource  = "*"
                      - Sid       = "Enable IAM User Permissions"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - tags                               = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
          - "Name"        = "prod-ehr-out-service-db-key"
        } -> null
      - tags_all                           = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
          - "Name"        = "prod-ehr-out-service-db-key"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # aws_rds_cluster.ehr_out_service will be destroyed
  # (because aws_rds_cluster.ehr_out_service is not in configuration)
  - resource "aws_rds_cluster" "ehr_out_service" {
      - allocated_storage                   = 1 -> null
      - apply_immediately                   = true -> null
      - arn                                 = "arn:aws:rds:eu-west-2:535760944720:cluster:prod-ehr-out-service-cluster" -> null
      - availability_zones                  = [
          - "eu-west-2a",
          - "eu-west-2b",
          - "eu-west-2c",
        ] -> null
      - backtrack_window                    = 0 -> null
      - backup_retention_period             = 5 -> null
      - cluster_identifier                  = "prod-ehr-out-service-cluster" -> null
      - cluster_members                     = [
          - "prod-ehr-out-service-db-instance-0",
          - "prod-ehr-out-service-db-instance-1",
          - "prod-ehr-out-service-db-instance-2",
        ] -> null
      - cluster_resource_id                 = "cluster-WWCI6QVOMXP352FV67MP7SLHJU" -> null
      - copy_tags_to_snapshot               = false -> null
      - database_name                       = "ehroutdb" -> null
      - db_cluster_parameter_group_name     = (sensitive value) -> null
      - db_subnet_group_name                = "prod-ehr-out-service-db-subnet-group" -> null
      - delete_automated_backups            = true -> null
      - deletion_protection                 = true -> null
      - enable_global_write_forwarding      = false -> null
      - enable_http_endpoint                = false -> null
      - enabled_cloudwatch_logs_exports     = [] -> null
      - endpoint                            = "prod-ehr-out-service-cluster.cluster-cyniu6lsek4i.eu-west-2.rds.amazonaws.com" -> null
      - engine                              = "aurora-postgresql" -> null
      - engine_mode                         = "provisioned" -> null
      - engine_version                      = "11.16" -> null
      - engine_version_actual               = "11.16" -> null
      - final_snapshot_identifier           = "ehr-out-service-db-final" -> null
      - hosted_zone_id                      = "Z1TTGA775OQIYO" -> null
      - iam_database_authentication_enabled = true -> null
      - iam_roles                           = [] -> null
      - id                                  = "prod-ehr-out-service-cluster" -> null
      - iops                                = 0 -> null
      - kms_key_id                          = "arn:aws:kms:eu-west-2:535760944720:key/bff26a73-7696-404d-abc1-4b9c189a1bed" -> null
      - master_password                     = (sensitive value) -> null
      - master_username                     = (sensitive value) -> null
      - network_type                        = "IPV4" -> null
      - port                                = 5432 -> null
      - preferred_backup_window             = "07:00-09:00" -> null
      - preferred_maintenance_window        = "wed:02:16-wed:02:46" -> null
      - reader_endpoint                     = "prod-ehr-out-service-cluster.cluster-ro-cyniu6lsek4i.eu-west-2.rds.amazonaws.com" -> null
      - skip_final_snapshot                 = false -> null
      - storage_encrypted                   = true -> null
      - tags                                = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
        } -> null
      - tags_all                            = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
        } -> null
      - vpc_security_group_ids              = [
          - "sg-00eb5a853d344a9d9",
          - "sg-09ae87c66f1831b1e",
          - "sg-0e692308c08c8b7af",
        ] -> null
        # (4 unchanged attributes hidden)
    }

  # aws_rds_cluster_instance.ehr_out_service_db_instances[0] will be destroyed
  # (because aws_rds_cluster_instance.ehr_out_service_db_instances is not in configuration)
  - resource "aws_rds_cluster_instance" "ehr_out_service_db_instances" {
      - arn                                   = "arn:aws:rds:eu-west-2:535760944720:db:prod-ehr-out-service-db-instance-0" -> null
      - auto_minor_version_upgrade            = true -> null
      - availability_zone                     = "eu-west-2c" -> null
      - ca_cert_identifier                    = "rds-ca-2019" -> null
      - cluster_identifier                    = "prod-ehr-out-service-cluster" -> null
      - copy_tags_to_snapshot                 = false -> null
      - db_parameter_group_name               = "default.aurora-postgresql11" -> null
      - db_subnet_group_name                  = "prod-ehr-out-service-db-subnet-group" -> null
      - dbi_resource_id                       = "db-XRFWYXGNFY5AYKDGNR7XZZR6XI" -> null
      - endpoint                              = "prod-ehr-out-service-db-instance-0.cyniu6lsek4i.eu-west-2.rds.amazonaws.com" -> null
      - engine                                = "aurora-postgresql" -> null
      - engine_version                        = "11.16" -> null
      - engine_version_actual                 = "11.16" -> null
      - id                                    = "prod-ehr-out-service-db-instance-0" -> null
      - identifier                            = "prod-ehr-out-service-db-instance-0" -> null
      - instance_class                        = "db.t3.medium" -> null
      - kms_key_id                            = "arn:aws:kms:eu-west-2:535760944720:key/bff26a73-7696-404d-abc1-4b9c189a1bed" -> null
      - monitoring_interval                   = 0 -> null
      - network_type                          = "IPV4" -> null
      - performance_insights_enabled          = false -> null
      - performance_insights_retention_period = 0 -> null
      - port                                  = 5432 -> null
      - preferred_backup_window               = "07:00-09:00" -> null
      - preferred_maintenance_window          = "wed:01:45-wed:02:15" -> null
      - promotion_tier                        = 0 -> null
      - publicly_accessible                   = false -> null
      - storage_encrypted                     = true -> null
      - tags                                  = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
        } -> null
      - tags_all                              = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
        } -> null
      - writer                                = true -> null
        # (2 unchanged attributes hidden)
    }

  # aws_rds_cluster_instance.ehr_out_service_db_instances[1] will be destroyed
  # (because aws_rds_cluster_instance.ehr_out_service_db_instances is not in configuration)
  - resource "aws_rds_cluster_instance" "ehr_out_service_db_instances" {
      - arn                                   = "arn:aws:rds:eu-west-2:535760944720:db:prod-ehr-out-service-db-instance-1" -> null
      - auto_minor_version_upgrade            = true -> null
      - availability_zone                     = "eu-west-2a" -> null
      - ca_cert_identifier                    = "rds-ca-2019" -> null
      - cluster_identifier                    = "prod-ehr-out-service-cluster" -> null
      - copy_tags_to_snapshot                 = false -> null
      - db_parameter_group_name               = "default.aurora-postgresql11" -> null
      - db_subnet_group_name                  = "prod-ehr-out-service-db-subnet-group" -> null
      - dbi_resource_id                       = "db-TOY4GITJSCUIDQ3M3RLIT5BPWE" -> null
      - endpoint                              = "prod-ehr-out-service-db-instance-1.cyniu6lsek4i.eu-west-2.rds.amazonaws.com" -> null
      - engine                                = "aurora-postgresql" -> null
      - engine_version                        = "11.16" -> null
      - engine_version_actual                 = "11.16" -> null
      - id                                    = "prod-ehr-out-service-db-instance-1" -> null
      - identifier                            = "prod-ehr-out-service-db-instance-1" -> null
      - instance_class                        = "db.t3.medium" -> null
      - kms_key_id                            = "arn:aws:kms:eu-west-2:535760944720:key/bff26a73-7696-404d-abc1-4b9c189a1bed" -> null
      - monitoring_interval                   = 0 -> null
      - network_type                          = "IPV4" -> null
      - performance_insights_enabled          = false -> null
      - performance_insights_retention_period = 0 -> null
      - port                                  = 5432 -> null
      - preferred_backup_window               = "07:00-09:00" -> null
      - preferred_maintenance_window          = "mon:00:07-mon:00:37" -> null
      - promotion_tier                        = 0 -> null
      - publicly_accessible                   = false -> null
      - storage_encrypted                     = true -> null
      - tags                                  = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
        } -> null
      - tags_all                              = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
        } -> null
      - writer                                = false -> null
        # (2 unchanged attributes hidden)
    }

  # aws_rds_cluster_instance.ehr_out_service_db_instances[2] will be destroyed
  # (because aws_rds_cluster_instance.ehr_out_service_db_instances is not in configuration)
  - resource "aws_rds_cluster_instance" "ehr_out_service_db_instances" {
      - arn                                   = "arn:aws:rds:eu-west-2:535760944720:db:prod-ehr-out-service-db-instance-2" -> null
      - auto_minor_version_upgrade            = true -> null
      - availability_zone                     = "eu-west-2a" -> null
      - ca_cert_identifier                    = "rds-ca-2019" -> null
      - cluster_identifier                    = "prod-ehr-out-service-cluster" -> null
      - copy_tags_to_snapshot                 = false -> null
      - db_parameter_group_name               = "default.aurora-postgresql11" -> null
      - db_subnet_group_name                  = "prod-ehr-out-service-db-subnet-group" -> null
      - dbi_resource_id                       = "db-II2IIFPCSS6OIWUEUEBRKVWBVE" -> null
      - endpoint                              = "prod-ehr-out-service-db-instance-2.cyniu6lsek4i.eu-west-2.rds.amazonaws.com" -> null
      - engine                                = "aurora-postgresql" -> null
      - engine_version                        = "11.16" -> null
      - engine_version_actual                 = "11.16" -> null
      - id                                    = "prod-ehr-out-service-db-instance-2" -> null
      - identifier                            = "prod-ehr-out-service-db-instance-2" -> null
      - instance_class                        = "db.t3.medium" -> null
      - kms_key_id                            = "arn:aws:kms:eu-west-2:535760944720:key/bff26a73-7696-404d-abc1-4b9c189a1bed" -> null
      - monitoring_interval                   = 0 -> null
      - network_type                          = "IPV4" -> null
      - performance_insights_enabled          = false -> null
      - performance_insights_retention_period = 0 -> null
      - port                                  = 5432 -> null
      - preferred_backup_window               = "07:00-09:00" -> null
      - preferred_maintenance_window          = "wed:05:02-wed:05:32" -> null
      - promotion_tier                        = 0 -> null
      - publicly_accessible                   = false -> null
      - storage_encrypted                     = true -> null
      - tags                                  = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
        } -> null
      - tags_all                              = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
        } -> null
      - writer                                = false -> null
        # (2 unchanged attributes hidden)
    }

  # aws_security_group.ecs_tasks_sg will be updated in-place
  ~ resource "aws_security_group" "ecs_tasks_sg" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ egress                 = (sensitive value)
        id                     = "sg-0da5787a08c9d95cd"
        name                   = "prod-ehr-out-service-ecs-tasks-sg"
        tags                   = {
            "CreatedBy"   = "prm-repo-ehr-out-service"
            "Environment" = "prod"
            "Name"        = "prod-ehr-out-service-ecs-tasks-sg"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_security_group.ehr_out_service_db_sg will be destroyed
  # (because aws_security_group.ehr_out_service_db_sg is not in configuration)
  - resource "aws_security_group" "ehr_out_service_db_sg" {
      - arn                    = "arn:aws:ec2:eu-west-2:535760944720:security-group/sg-0e692308c08c8b7af" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-0e692308c08c8b7af" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow traffic from ehr-out-service to the db"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0da5787a08c9d95cd",
                ]
              - self             = false
              - to_port          = 5432
            },
        ] -> null
      - name                   = "prod-ehr-out-service-db-sg" -> null
      - owner_id               = "535760944720" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
          - "Name"        = "prod-ehr-out-service-db-sg"
        } -> null
      - tags_all               = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
          - "Name"        = "prod-ehr-out-service-db-sg"
        } -> null
      - vpc_id                 = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # aws_security_group.gocd_to_db_sg will be destroyed
  # (because aws_security_group.gocd_to_db_sg is not in configuration)
  - resource "aws_security_group" "gocd_to_db_sg" {
      - arn                    = "arn:aws:ec2:eu-west-2:535760944720:security-group/sg-09ae87c66f1831b1e" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-09ae87c66f1831b1e" -> null
      - ingress                = (sensitive value) -> null
      - name                   = "prod-gocd-to-ehr-out-service-db-sg" -> null
      - owner_id               = "535760944720" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
          - "Name"        = "prod-gocd-to-ehr-out-service-db-sg"
        } -> null
      - tags_all               = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
          - "Name"        = "prod-gocd-to-ehr-out-service-db-sg"
        } -> null
      - vpc_id                 = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # aws_security_group.gocd_to_service_alb will be updated in-place
  ~ resource "aws_security_group" "gocd_to_service_alb" {
        id                     = "sg-06495eda1ee3414ff"
      ~ ingress                = (sensitive value)
        name                   = "prod-gocd-to-ehr-out-service"
        tags                   = {
            "CreatedBy"   = "prm-repo-ehr-out-service"
            "Environment" = "prod"
            "Name"        = "prod-gocd-to-ehr-out-service-sg"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_security_group.vpn_to_db_sg will be destroyed
  # (because aws_security_group.vpn_to_db_sg is not in configuration)
  - resource "aws_security_group" "vpn_to_db_sg" {
      - arn                    = "arn:aws:ec2:eu-west-2:535760944720:security-group/sg-00eb5a853d344a9d9" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-00eb5a853d344a9d9" -> null
      - ingress                = [] -> null
      - name                   = "prod-vpn-to-ehr-out-service-db-sg" -> null
      - owner_id               = "535760944720" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
          - "Name"        = "prod-vpn-to-ehr-out-service-db-sg"
        } -> null
      - tags_all               = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
          - "Name"        = "prod-vpn-to-ehr-out-service-db-sg"
        } -> null
      - vpc_id                 = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # aws_sqs_queue.ehr-out-service-incoming-dlq will be created
  + resource "aws_sqs_queue" "ehr-out-service-incoming-dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "c48be3ca-1ac9-46df-8a10-29ffb77cd9cf"
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "prod-ehr-out-service-incoming-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 20
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "CreatedBy"   = "prm-repo-ehr-out-service"
          + "Environment" = "prod"
          + "Name"        = "prod-ehr-out-service-incoming-dlq"
        }
      + tags_all                          = {
          + "CreatedBy"   = "prm-repo-ehr-out-service"
          + "Environment" = "prod"
          + "Name"        = "prod-ehr-out-service-incoming-dlq"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 240
    }

  # aws_sqs_queue.service_incoming will be updated in-place
  ~ resource "aws_sqs_queue" "service_incoming" {
        id                                = "https://sqs.eu-west-2.amazonaws.com/535760944720/prod-ehr-out-service-incoming"
        name                              = "prod-ehr-out-service-incoming"
      + redrive_policy                    = (known after apply)
        tags                              = {
            "CreatedBy"   = "prm-repo-ehr-out-service"
            "Environment" = "prod"
            "Name"        = "prod-ehr-out-service-incoming"
        }
      ~ visibility_timeout_seconds        = 240 -> 900
        # (17 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.ehr_out_service_incoming will be updated in-place
  ~ resource "aws_sqs_queue_policy" "ehr_out_service_incoming" {
        id        = "https://sqs.eu-west-2.amazonaws.com/535760944720/prod-ehr-out-service-incoming"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:SendMessage"
                      - Condition = {
                          - ArnEquals = {
                              - "aws:SourceArn" = "arn:aws:sns:eu-west-2:535760944720:prod-ehr-transfer-service-unhandled-sns-topic"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "sns.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sqs:eu-west-2:535760944720:prod-ehr-out-service-incoming"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_ssm_parameter.db_host will be destroyed
  # (because aws_ssm_parameter.db_host is not in configuration)
  - resource "aws_ssm_parameter" "db_host" {
      - arn             = "arn:aws:ssm:eu-west-2:535760944720:parameter/repo/prod/output/prm-repo-ehr-out-service/db-host" -> null
      - data_type       = "text" -> null
      - id              = "/repo/prod/output/prm-repo-ehr-out-service/db-host" -> null
      - name            = "/repo/prod/output/prm-repo-ehr-out-service/db-host" -> null
      - tags            = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
        } -> null
      - tags_all        = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
        } -> null
      - tier            = "Standard" -> null
      - type            = "String" -> null
      - value           = (sensitive value) -> null
      - version         = 1 -> null
        # (3 unchanged attributes hidden)
    }

  # aws_ssm_parameter.db_name will be destroyed
  # (because aws_ssm_parameter.db_name is not in configuration)
  - resource "aws_ssm_parameter" "db_name" {
      - arn             = "arn:aws:ssm:eu-west-2:535760944720:parameter/repo/prod/output/prm-repo-ehr-out-service/db-name" -> null
      - data_type       = "text" -> null
      - id              = "/repo/prod/output/prm-repo-ehr-out-service/db-name" -> null
      - name            = "/repo/prod/output/prm-repo-ehr-out-service/db-name" -> null
      - tags            = {} -> null
      - tags_all        = {} -> null
      - tier            = "Standard" -> null
      - type            = "String" -> null
      - value           = (sensitive value) -> null
      - version         = 1 -> null
        # (3 unchanged attributes hidden)
    }

  # aws_ssm_parameter.db_resource_cluster_id will be destroyed
  # (because aws_ssm_parameter.db_resource_cluster_id is not in configuration)
  - resource "aws_ssm_parameter" "db_resource_cluster_id" {
      - arn             = "arn:aws:ssm:eu-west-2:535760944720:parameter/repo/prod/output/prm-repo-ehr-out-service/db-resource-cluster-id" -> null
      - data_type       = "text" -> null
      - id              = "/repo/prod/output/prm-repo-ehr-out-service/db-resource-cluster-id" -> null
      - name            = "/repo/prod/output/prm-repo-ehr-out-service/db-resource-cluster-id" -> null
      - tags            = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
        } -> null
      - tags_all        = {
          - "CreatedBy"   = "prm-repo-ehr-out-service"
          - "Environment" = "prod"
        } -> null
      - tier            = "Standard" -> null
      - type            = "String" -> null
      - value           = (sensitive value) -> null
      - version         = 1 -> null
        # (3 unchanged attributes hidden)
    }

  # aws_ssm_parameter.service_url will be destroyed
  # (because aws_ssm_parameter.service_url is not in configuration)
  - resource "aws_ssm_parameter" "service_url" {
      - arn             = "arn:aws:ssm:eu-west-2:535760944720:parameter/repo/prod/output/prm-repo-ehr-out-service/ehr-out-service-service-url" -> null
      - data_type       = "text" -> null
      - id              = "/repo/prod/output/prm-repo-ehr-out-service/ehr-out-service-service-url" -> null
      - name            = "/repo/prod/output/prm-repo-ehr-out-service/ehr-out-service-service-url" -> null
      - tags            = {} -> null
      - tags_all        = {} -> null
      - tier            = "Standard" -> null
      - type            = "String" -> null
      - value           = (sensitive value) -> null
      - version         = 1 -> null
        # (3 unchanged attributes hidden)
    }

Plan: 6 to add, 7 to change, 15 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>